{"config": [{"config": {"name": "lambda_1", "batch_input_shape": [null, 64, 64, 3], "function_type": "lambda", "output_shape": null, "input_dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0012\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "arguments": {}}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "b_regularizer": null, "nb_filter": 24, "nb_row": 5, "b_constraint": null, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activation": "linear", "nb_col": 5, "W_constraint": null, "activity_regularizer": null, "init": "he_normal", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "prelu_1", "trainable": true, "init": "zero"}, "class_name": "PReLU"}, {"config": {"name": "batchnormalization_1", "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "trainable": true, "mode": 0, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "convolution2d_2", "b_regularizer": null, "nb_filter": 36, "nb_row": 5, "b_constraint": null, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activation": "linear", "nb_col": 5, "W_constraint": null, "activity_regularizer": null, "init": "he_normal", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "prelu_2", "trainable": true, "init": "zero"}, "class_name": "PReLU"}, {"config": {"name": "batchnormalization_2", "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "trainable": true, "mode": 0, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "convolution2d_3", "b_regularizer": null, "nb_filter": 48, "nb_row": 5, "b_constraint": null, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activation": "linear", "nb_col": 5, "W_constraint": null, "activity_regularizer": null, "init": "he_normal", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "prelu_3", "trainable": true, "init": "zero"}, "class_name": "PReLU"}, {"config": {"name": "batchnormalization_3", "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "trainable": true, "mode": 0, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "convolution2d_4", "b_regularizer": null, "nb_filter": 64, "nb_row": 3, "b_constraint": null, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "activation": "linear", "nb_col": 3, "W_constraint": null, "activity_regularizer": null, "init": "he_normal", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "prelu_4", "trainable": true, "init": "zero"}, "class_name": "PReLU"}, {"config": {"name": "batchnormalization_4", "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "trainable": true, "mode": 0, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_5", "b_regularizer": null, "nb_filter": 64, "nb_row": 3, "b_constraint": null, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "activation": "linear", "nb_col": 3, "W_constraint": null, "activity_regularizer": null, "init": "he_normal", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "prelu_5", "trainable": true, "init": "zero"}, "class_name": "PReLU"}, {"config": {"name": "batchnormalization_5", "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "trainable": true, "mode": 0, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1164, "trainable": true, "input_dim": 576, "bias": true, "W_constraint": null, "activation": "linear", "init": "he_normal"}, "class_name": "Dense"}, {"config": {"name": "prelu_6", "trainable": true, "init": "zero"}, "class_name": "PReLU"}, {"config": {"name": "batchnormalization_6", "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "trainable": true, "mode": 0, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.8}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 100, "trainable": true, "input_dim": 1164, "bias": true, "W_constraint": null, "activation": "linear", "init": "he_normal"}, "class_name": "Dense"}, {"config": {"name": "prelu_7", "trainable": true, "init": "zero"}, "class_name": "PReLU"}, {"config": {"name": "batchnormalization_7", "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "trainable": true, "mode": 0, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.8}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 50, "trainable": true, "input_dim": 100, "bias": true, "W_constraint": null, "activation": "linear", "init": "he_normal"}, "class_name": "Dense"}, {"config": {"name": "prelu_8", "trainable": true, "init": "zero"}, "class_name": "PReLU"}, {"config": {"name": "batchnormalization_8", "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "trainable": true, "mode": 0, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "dense_4", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 10, "trainable": true, "input_dim": 50, "bias": true, "W_constraint": null, "activation": "linear", "init": "he_normal"}, "class_name": "Dense"}, {"config": {"name": "prelu_9", "trainable": true, "init": "zero"}, "class_name": "PReLU"}, {"config": {"name": "batchnormalization_9", "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "trainable": true, "mode": 0, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "dense_5", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "trainable": true, "input_dim": 10, "bias": true, "W_constraint": null, "activation": "tanh", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}