{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 64, 64, 3], "arguments": {}, "output_shape_type": "raw", "input_dtype": "float32", "trainable": true, "name": "lambda_1", "output_shape": [64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>h\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "trainable": true, "W_constraint": null, "name": "convolution2d_1", "nb_row": 8, "init": "glorot_uniform", "nb_filter": 16, "bias": true, "subsample": [4, 4], "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_col": 8, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "trainable": true, "W_constraint": null, "name": "convolution2d_2", "nb_row": 5, "init": "glorot_uniform", "nb_filter": 32, "bias": true, "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_col": 5, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "trainable": true, "W_constraint": null, "name": "convolution2d_3", "nb_row": 5, "init": "glorot_uniform", "nb_filter": 64, "bias": true, "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_col": 5, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "bias": true, "output_dim": 512, "input_dim": 1024, "W_regularizer": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "bias": true, "output_dim": 1, "input_dim": 512, "W_regularizer": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}}]}