{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "he_normal", "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 3, "trainable": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "batch_input_shape": [null, 64, 64, 3], "bias": true, "name": "conv0", "W_regularizer": null, "subsample": [1, 1], "nb_row": 1, "activity_regularizer": null, "input_dtype": "float32", "nb_col": 1}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "nb_filter": 32, "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true, "name": "conv1", "W_regularizer": null, "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "nb_filter": 32, "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true, "name": "conv2", "W_regularizer": null, "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "nb_filter": 64, "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true, "name": "conv3", "W_regularizer": null, "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "nb_filter": 64, "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true, "name": "conv4", "W_regularizer": null, "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "nb_filter": 128, "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true, "name": "conv5", "W_regularizer": null, "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "nb_filter": 128, "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true, "name": "conv6", "W_regularizer": null, "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "he_normal", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 512, "input_dim": null, "name": "hidden1", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"init": "he_normal", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 64, "input_dim": null, "name": "hidden2", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"init": "he_normal", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 16, "input_dim": null, "name": "hidden3", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"init": "he_normal", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 1, "input_dim": null, "name": "output", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias": true}}], "keras_version": "1.1.2"}